{
    "AC": [
        "Alternating Current",
        "Alternating current (AC) refers to the flow of electric current that periodically reverses its direction. It is measured in amperes (A) and the direction of the current changes at regular intervals, typically measured in cycles per second, or hertz (Hz)."
    ],
    "ACL": [
        "Access Control List",
        "The ACL is a list of rules that specify which users or systems are granted or denied access to a particular object or system resource. Access control lists are also installed in routers or switches where they act as filters, managing which traffic can access the network, used to improve security."
    ],
    "ADAS": [
        "Advanced Driver Assistance Systems",
        "ADAS is the term used in the auto industry to describe automotive safety features using advanced technology such as cameras and other sensors to provide safety warnings and even assist the driver in braking or steering to avoid dangerous situations. The role of ADAS is to prevent deaths and injuries by reducing the number of car accidents."
    ],
    "ADC": [
        "A/D Converter, Analog-to-Digital Converter",
        "An analog-to-digital converter is a circuit that converts a continuous voltage value (analog) to a binary value (digital) that can be understood by a digital device and used for digital computation."
    ],
    "AEC": [
        "Automotive Electronics Council",
        "The Automotive Electronics Council is an organization originally established by major automotive manufacturers including Chrysler, Ford, and GM in the 1990s to promote common part-qualification and quality-system standards."
    ],
    "AFE": [
        "Analog Front-End",
        "An AFE is a set of analog signal conditioning circuitry, comprised of analog amplifiers, op amps, filters, and integrated circuits, to interface with a variety of sensors. It can amplify and/or filter sensor signals that are often weak and may have complex electrical configurations to support different MCUs. This configurable functional block helps convert sensor outputs to a signal conducive to the analog to digital converter input, or just a good, solid, low noise and high dynamic range signal."
    ],
    "AN": [
        "Auto-Negotiation",
        "Auto-Negotiation is a mechanism defined in the IEEE 802.3 standard that allows connected devices to exchange information over a link and determine common transmission parameters including duplex mode, speed, and flow control, so as to establish the best mode of connection between devices."
    ],
    "ASA": [
        "Automotive SerDes Alliance",
        "ASA is a non-profit industry alliance of automotive technology providers collaborating to encourage standardizing of asymmetric SerDes technology."
    ],
    "AUI": [
        "Attachment Unit Interface",
        "An AUI is a 15 pin connection that provides a path between a node's Ethernet interface and the MAU (Medium Attachment Unit), sometimes known as a transceiver. It is the part of the IEEE Ethernet standard located between the Media Access Control (MAC), and the MAU."
    ],
    "BIST": [
        "Built-in Self Test",
        "BIST is a DFT (Design-for-Testability) technique of designing additional hardware and software features into integrated circuits to allow them to perform self-testing using their own circuits. It reduces dependence on an external ATE (automated test equipment), making the electrical testing of a chip easier, faster, more efficient, and less costly."
    ],
    "BLW": [
        "Baseline Wander",
        "The average signal power at the receiver is taken as the \"baseline\", which serves as a reference in decoding the received signal bit value. BLW refers to long string binary data drifting baseline makes it difficult for the receiver to decode the data correctly."
    ],
    "BOM": [
        "Bill of Materials",
        "A bill of materials (BOM) is an inventory of raw materials, assemblies, and components as well as their required quantities and additional specifications for manufacturing a product. It is important that BOM provides highly accurate and detailed information."
    ],
    "BPDU": [
        "Bridge Protocol Data Unit",
        "BPDU configuration messages are frames sent by each switch that contain information to configure and maintain spanning tree topology. Switches send BPDUs using a unique MAC (Media Access Control) address from its origin port and a multicast address as destination MAC. These data messages are transmitted across LAN (Local Area Network) to detect loops in network topologies."
    ],
    "CAM": [
        "Content-Addressable Memory",
        "CAM is a data storage device that stores memory in cells. When any aspect of the memory is entered, the CAM compares the input with all the stored data. It is a high-speed technology. In CAM, memories are not arranged in chronological order nor packed in isolated modules."
    ],
    "CCM": [
        "Continuity Check Message",
        "A CCM is a multicast frame that is generated by a MEP (Maintenance Association End Point) and multicast to all other MEPs in the same MA, so as to detect loss of continuity or incorrect network connections."
    ],
    "CDC": [
        "Clock Domain Crossing",
        "The process of passing a signal or vector (multi bit signal) from one clock domain to another clock domain."
    ],
    "CDM": [
        "Charged-Device Model",
        "The CDM is a model for characterizing the susceptibility of an electronic device to damage from ESD (Electrostatic Discharge)."
    ],
    "CFG": [
        "Control Flow Guard",
        "The CFG is a highly-optimized platform security feature that was created to combat memory corruption vulnerabilities."
    ],
    "CFI": [
        "Canonical Format Indicator",
        "CFI in the VLAN tag, also called Drop Eligible Indicator (DEI), identifies the drop priority of packets in certain situations. When the rate of packets on certain devices exceeds the committed information rate (CIR) value, the value of the DEI field is set to 1."
    ],
    "CRC": [
        "Cyclic Redundancy Check",
        "CRC is an error-detecting code commonly used in digital networks and storage devices to detect accidental changes to raw data and determine whether a block of data has been corrupted."
    ],
    "CSI": [
        "Camera Serial Interface",
        "CSI is a specification of MIPI (Mobile Industry Processor Interface) alliance to standardize the interface between a camera device and a host processor. The specification provides mobile device manufacturers a standardized high-performance interface that scales with the increased frame rates, resolution, and pixel depth of the imaging systems."
    ],
    "CSMA/CD": [
        "Carrier-Sense Multiple Access with Collision Detection",
        "CSMA/CD is a MAC (Media Access Control) method which helps hosts to decide when to send packets on a shared network segment and how to detect collisions if they occur. CSMA/CD senses the wire first and only starts transmission when the channel is clear. Upon collision detection in CSMA/CD, it stops transmission, sends a jam signal, and then waits for a random time context before re-transmission. CSMA/CD is useful for efficiently sharing network resources and preventing data collisions in LAN environments."
    ],
    "DA": [
        "Destination Address",
        "DA is a term frequently used in the networking realm to signify the recipient of a piece of data. The DA could be in the form of a Layer 2 MAC (Media Access Control) Destination Address and identify the NIC (Network Interface Card) of the intended recipient or a Layer 3 IP Destination Address and identify a particular host on a network."
    ],
    "DAC": [
        "D/A Converter, Digital-to-Analog Converter",
        "A digital-to-analog converter is to convert digital signal to a set of continuous analog voltages or currents. It is an integrated analog peripheral that provides a variable voltage reference that is ratio metric with an input source. DACs are defined by their bit resolution, which indicates how many selectable voltage levels are possible between the positive and negative voltage sources. DACs are commonly available as separate ICs."
    ],
    "DC": [
        "Direct Current",
        "Direct current (DC) is an electric current that flows in one direction only, with no changes in frequency or polarity."
    ],
    "DEI": [
        "Drop Eligible Indicator",
        "The 1-bit DEI field can be used individually or in combination with PCP to identify frames that can be dropped during network congestion management. DEI's default value is 0, meaning the frame is not drop-eligible."
    ],
    "DEI/CFI": [
        "Drop Eligible Indicator / Canonical Format Indicator",
        "The Canonical Format Indicator (CFI) in the VLAN tag, also called Drop Eligible Indicator (DEI), identifies the drop priority of packets in certain situations. When the rate of packets on certain devices exceeds the committed information rate (CIR) value, the value of the DEI field is set to 1. In this case, the drop priority of the packets is high. When congestion occurs, the devices first discard the packets whose DEI field is 1."
    ],
    "DLL": [
        "Data Link Layer",
        "The DLL is the second layer from the bottom in the OSI (Open System Interconnection) network architecture model. It is responsible for the node-to-node delivery of data, to ensure error-free transmission of information, and is also responsible to encode, decode and organize the outgoing and incoming data."
    ],
    "DLP": [
        "Data Loss Prevention",
        "DLP is a part of a company's overall security strategy that detects data loss, as well as prevents the illicit transfer of data outside the organization and the unwanted destruction of sensitive or personally identifiable data."
    ],
    "DNS": [
        "Domain Name System",
        "The DNS acts as a lookup system translating between domain names and IP addresses. Domain names are easier for humans to remember and use, whereas IP addresses are necessary for machines to locate and communicate with one another."
    ],
    "DSCP": [
        "Differentiated Services Codepoint",
        "Differentiated Services Codepoint is a means of classifying and managing network traffic and of providing QoS (Quality of Service) in modern Layer 3 IP networks."
    ],
    "DSP": [
        "Digital Signal Processing",
        "Digital Signal Processing (DSP) is a branch of electrical engineering that deals with the analysis, processing, and modification of digital signals using mathematical algorithms. It involves the manipulation of signals in the time domain, frequency domain, and/or spatial domain to extract meaningful information or improve signal quality. DSP plays a critical role in many modern technologies, including wireless communications, audio and video processing, medical imaging, radar systems, and control systems. DSP techniques include digital filtering, spectral analysis, signal generation, and statistical signal processing."
    ],
    "DT": [
        "Display Type",
        "The DT command displays information about a local variable, global variable or data type. This can display information about simple data types, as well as structures and unions."
    ],
    "DWRR": [
        "Deficit Weighted Round Robin, also referred to as Deficit Round Robin (DRR)",
        "Deficit Weight Round Robin, also called Deficit Round Robin (DRR), is a scheduling algorithm for the network scheduler. DRR is, like Weighted Fair Queuing (WFQ), a packet-based implementation of the ideal Generalized Processor Sharing (GPS) policy."
    ],
    "ECC": [
        "Error-Correcting Code",
        "ECC protects your system from potential crashes and inadvertent changes in data by automatically correcting data errors."
    ],
    "ECU": [
        "Electronic Control Unit",
        "ECU is an electronic device that controls a specific function."
    ],
    "EEE": [
        "Energy-Efficient Ethernet",
        "Energy-Efficient Ethernet (EEE) is a mechanism defined by IEEE 802.3az to reduce power dissipation during periods of low link utilization. A normal Ethernet link in an idle mode also consumes power. To reduce this consumption, EEE provides a signaling protocol called LPI (Low Power Idle) to achieve power saving."
    ],
    "EEPROM": [
        "Electrically Erasable Programmable Read-Only Memory",
        "EEPROM is a user-modifiable, non-volatile ROM, also known as byte erasable chips. EEPROM can be erased and re-programmed (written to) repeatedly using an electrical voltage, which allows you to store small chunks of data in computing and other electronic devices."
    ],
    "EMC": [
        "Electromagnetic Compatibility",
        "EMC refers to the ability of the device to work properly in the presence of electromagnetic radiation, and not generate additional EMI (electromagnetic interference) that affects the operation of other devices in its vicinity. EMC can be improved through good design, shielding, and EMI filtering. For each industry sector, there are specific EMC standards to follow. EMC is measured by testing both immunity and emissions."
    ],
    "EMI": [
        "Electromagnetic Interference",
        "EMI refers to the disturbance caused by electromagnetic radiation emitted from an electronic device that interferes with the proper functioning of other devices in the vicinity. This interference can occur in different frequency ranges, from low-frequency interference (such as power line noise) to high-frequency interference (such as radio frequency interference). EMI can be caused by many factors, such as poor grounding, electromagnetic radiation from nearby electronic devices, and electromagnetic fields generated by motors and other equipment. To ensure the reliable operation of electronic devices, it is essential to design them to minimize their EMI emissions and to protect them from external sources of EMI."
    ],
    "ESD": [
        "Electrostatic Discharge",
        "ESD is the sudden release of static electricity between two electrically charged objects caused by contact, an electrical short or dielectric breakdown. Under certain conditions, transference of electrical potential may occur when two materials with different charges come into proximity to each other. This common phenomenon, known as electrostatic discharge (ESD), can range in magnitude from a barely measurable electron movement all the way up to hundreds of millions of volts contained in the typical lightning strike of an ordinary thunderstorm."
    ],
    "FCS": [
        "Frame Check Sequence",
        "A frame check sequence is an error-detecting code added to a frame in a communication protocol. Frames are used to send payload data from a source to a destination."
    ],
    "FEC": [
        "Forward Error Correction",
        "FEC is a technique used in data communications where a transmitter of digital data adds extra information, known as check bits, to the data stream. When errors are sufficiently randomly distributed, these parity bits can be used by the receiver to identify bits which are in error and allow correction."
    ],
    "FIB": [
        "Forwarding Information Base",
        "A FIB, also known as a forwarding table or MAC table, is most commonly used in network bridging, routing, and similar functions to find the proper output network interface controller to which the input interface should forward a packet. It is a dynamic table that maps MAC addresses to ports."
    ],
    "FIFO": [
        "First In, First Out",
        "In computing and in systems theory, FIFO is an acronym for first in, first out, a method for organizing the manipulation of a data structure where the oldest entry, or \"head\" of the queue, is processed first."
    ],
    "FLP": [
        "Fast Link Pulse",
        "FLPs are basis for Auto-Negotiation functionality that allow network devices to negotiate their connection speed and duplex mode automatically, without the need for manual configuration. A fast link pulse burst contains 10BASE-T Normal Link Pulses (NLPs), and consists of 33 pulse positions, with 17 odd-numbered positions corresponding to clock pulses (always present) and 16 even-numbered positions corresponding to data pulses (which may be present or not). The 16-bit data word, encoded by the data pulses, is called a link code word (LCW), or pages."
    ],
    "FSM": [
        "Finite State Machine",
        "A computation model that can be implemented with hardware or software and can be used to simulate sequential logic and some computer programs."
    ],
    "GID": [
        "Global Identifier",
        "The GID is a 128-bit identifier similar to an IPv6 address (technically, a GID is a valid IPv6 identifier with restrictions)."
    ],
    "GMRP": [
        "GARP Multicast Registration Protocol",
        "GMRP is an application of GARP (Generic Attribute Registration Protocol) that provides a constrained multicast flooding facility."
    ],
    "GPIO": [
        "General Purpose Input/Output",
        "GPIO is a set of pins whose functions are customizable and can be controlled by software. It provides a basic way to interface the MCU (Microcontroller Unit) with the outside world."
    ],
    "GVRP": [
        "GARP VLAN Registration Protocol",
        "GVRP is an application of GARP (Generic Attribute Registration Protocol). It is a standard-based protocol that facilitates control of virtual local area networks (VLANs) within a larger network."
    ],
    "HBM": [
        "Human Body Model",
        "The HBM is the model used to characterize the susceptibility of electronic devices that might be subject to damage from ESD (Electrostatic Discharge)."
    ],
    "HOL": [
        "Head of Line",
        "Head-of-line blocking in networking is a performance issue that occurs when a bunch of packets is blocked by the first packet in line. It can happen specially in input buffered network switches where out-of-order delivery of packets can occur. A switch can be composed of input buffered ports, output buffered ports and switch fabric."
    ],
    "I2C": [
        "Inter-Integrated Circuit",
        "I2C is a serial communication protocol widely used for short-distance communication, which uses only 2 bi-directional open-drain lines for data communication."
    ],
    "IBG": [
        "Inter Burst Gap",
        "The IBG is the interval between two bursts. Bursts are sets of a specified number of packets, separated by programmed gaps between the sets. For Ethernet modules, IBGs are inserted between the sets."
    ],
    "ICMP": [
        "Internet Control Message Protocol",
        "The ICMP is a protocol used by devices within a network to communicate problems with data transmission.  One of the primariy ways that ICMP is used is to determine if data is getting to its destination and at the right time. ICMP is therefore an important aspect of the error reporting process and testing to see how well a network is transmitting data."
    ],
    "IFG": [
        "Interframe Gap",
        "The interframe gap is an idle time between network frames, also known as interpacket gap (IPG). The frames running along the line is not tightly back to back. There should be some space (time gap) with a certain minimum duration. This time gap is called IFG."
    ],
    "IGMP": [
        "Internet Group Management Protocol",
        "The IGMP is a communication protocol used by hosts and adjacent routers for multicasting communication with IP networks and uses the resources efficiently to transmit the message/data packets."
    ],
    "IPG": [
        "Interpacket Gap",
        "The interpacket gap is a pause between network packets, also known as interframe gap (IFG). It is a minimum amount of time that must transpire between the transmission of one data packet and the beginning of the transmission of a subsequent data packet by the same sender."
    ],
    "IPv4": [
        "Internet Protocol version 4",
        "An IPv4 address consists of four decimal numbers; each number ranges from 0 to 255, separated by dots. \nIPv6 is the newer version designed to accommodate the increasing number of devices to provide larger address space."
    ],
    "IRQ": [
        "Interrupt Request",
        "An IRQ is a signal sent by a hardware component to the CPU that interrupts the execution of a program and runs the interrupt handler code associated with the request."
    ],
    "ISP": [
        "Internet Service Provider",
        "Internet Service Provider refers to a company that provides access to the Internet to both personal and business customers."
    ],
    "IVL": [
        "Independent VLAN Learning",
        "Each VLAN uses its own logical Source Address Table. Transparent source address learning done as a result of ingressed VLAN x traffic is not made available on behalf of ingressed VLAN traffic for forwarding purposes."
    ],
    "LAN": [
        "Local Area Network",
        "A LAN is a network that connects computers and devices within a limited area, such as a home, office, or campus. It enables fast communication, resource sharing, and internet access using wired (Ethernet) or wireless (Wi-Fi) connections."
    ],
    "LDO": [
        "Low-Dropout",
        "LDO is a type of linear voltage regulator that regulates the output voltage and maintains a very small difference between input voltage and output voltage. This helps control heat build-up and results in minimal energy loss, making it an efficient and effective solution for voltage regulation in electronic devices. LDOs are commonly used in circuits where a stable voltage is required, such as in power management for microprocessors and digital circuits."
    ],
    "LED": [
        "Light-Emitting Diode",
        "A light-emitting diode (LED) is a type of semiconductor device that emits light when a current passes through it. The process involves the recombination of electrons and electron holes within the semiconductor, resulting in the release of energy in the form of photons. The color of the light emitted by an LED is determined by the energy required for electrons to cross the band gap of the semiconductor material. White light can be produced by using multiple semiconductors or a layer of light-emitting phosphor on the LED. LEDs are used in a wide range of applications, from lighting to electronic displays, due to their energy efficiency, durability, and long lifespan."
    ],
    "LLDP": [
        "Link Layer Discovery Protocol",
        "The LLDP is a vendor-neutral link layer protocol used by network devices for advertising their identity, capabilities, and neighbors on a local area network based on IEEE 802 technology, principally wired Ethernet."
    ],
    "LPI": [
        "Low Power Idle",
        "The LPI mode is a feature specific to modern processors that reduces the processor's power consumption during idle periods. When the processor is idle, it can enter different low power idle states to conserve power, by reducing its clock frequency and voltage, and even shutting down some of its internal components to lower power consumption."
    ],
    "LQFP": [
        "Low-Profile Quad Flat Package",
        "A quad flat package (QFP) is a surface-mounted integrated circuit package with gull-wing leads (ie., pins) extending from each of the four sides of the package. The variants include low-profile QFP (LQFP) and thin QFP (TQFP). LQFP features longer leads and has a greater lead count range, which make it easy to be attached to the Printed Circuit Board (PCB) for mechanical, electrical and thermal connections."
    ],
    "LSB": [
        "Least Significant Bit",
        "The LSB refers to the lowest bit in a binary number. In contrast, the MSB (Most Significant Bit) refers to the highest bit in the same binary number."
    ],
    "LTM": [
        "Link Trace Message",
        "LTMs are multicast frames that a MEP (Maintenance association End Point) transmits to track the path (hop-by-hop) to a destination MEP in the same MA and within the same MD (Maintenance Domain) level.  The message body of an LTM includes a destination MAC address of a target MEP that terminates the linktrace. Each receiving MEP sends a unicast Link Trace Reply directly to the initiating MEP, and forwards the LTM to the target MEP destination MAC address. LTM can also be used for fault isolation."
    ],
    "MAC": [
        "Media Access Control",
        "MAC is a sublayer of the data link layer in the OSI model that controls access to a shared communication medium. It is responsible for regulating the transmission of data packets over the medium, typically through techniques such as carrier sensing, contention resolution, and access priority management. The MAC layer works in conjunction with the physical layer to provide a reliable communication link between network nodes."
    ],
    "MBSC": [
        "Multicast/Broadcast Storm Control",
        "Storm control is a feature for monitoring traffic levels and dropping broadcast, multicast, and unknown unicast packets, which is commonly known as BUM Traffic, and when a specified traffic level, referred to as the storm control level or storm control bandwidth is exceeded, limiting the traffic to protect the Local Area Network environment."
    ],
    "MCU": [
        "Microcontroller Unit",
        "A microcontroller unit (MCU) contains a CPU, memory, and input/output peripherals on a single integrated circuit (IC) chip and works as a standalone small computer. It is also known as a Single-Chip Microcomputer."
    ],
    "MDC": [
        "Management Data Clock",
        "MDC is the clock driven by the MAC (Media Access Control) device to the PHY (Physical Layer). It is one of the two signals of the MDIO (Management Data Input/Output) bus."
    ],
    "MDI": [
        "Medium Dependent Interface",
        "MDI is a standard interface used in Ethernet networking that connects the PHY (Physical Layer) device to the MAC (Media Access Control) layer device. It is a crucial component of the media attachment unit, providing the necessary electrical and mechanical interface for transmitting and receiving data signals over the physical medium, such as copper or fiber optic cables. It enables the reliable transmission of data signals between devices in an Ethernet network, facilitating communication between different network layers and ensuring efficient data transfer."
    ],
    "MDIO": [
        "Management Data Input/Output",
        "MDIO, also known as the Serial Management Interface (SMI), is a serial bus used in Ethernet networks to connect Media Access Control (MAC) devices to Physical Layer (PHY) circuits. It allows the MAC device to read and write to the PHY control register. The MDIO bus consists of two signals: MDC (Management Data Clock) and MDIO (Management Data Input/Output). It is defined as part of the Media Independent Interface (MII) for Ethernet in the IEEE 802.3 standard."
    ],
    "MDIX": [
        "Medium Dependent Interface Crossover",
        "MDIX is a version of Medium Dependent Interface (MDI) that enables a connection between corresponding devices without the need for a crossover cable. It allows crossover (X) signals to be transmitted and received, and is commonly found in Ethernet switches and network hubs. Auto-MDIX is a feature that automatically configures the cable connection, allowing both crossover and straight-through cabling to be used."
    ],
    "MIB": [
        "Management Information Base",
        "MIB is a hierarchical database of network objects that describe a device monitored by a network management system (NMS). Each managed object in a MIB has a unique identifier. The identifier includes the object's type (such as counter, string, gauge, or address), the object's access level (such as read or read/write), size restrictions, and range information. MIBs function as a kind of directory containing the logical names of the network resources and their configuration parameters that are managed by SNMP."
    ],
    "MII": [
        "Media-Independent Interface",
        "MII is a standard interface used to connect the Media Access Controller (MAC) block to the Physical Layer (PHY) in networking devices. The Reduced Media-Independent Interface (RMII) is a version of MII developed to reduce the number of signals required to connect MAC to PHY."
    ],
    "MIPI": [
        "Mobile Industry Processor Interface",
        "MIPI is an industry consortium specifying high-speed serial interface solutions to interconnect between components inside a mobile device."
    ],
    "MLD": [
        "Multicast Listener Discovery",
        "The MLD Protocol manages the membership of hosts and routers in multicast groups. IP version 6 (IPv6) multicast routers use MLD to learn which groups have listeners interested in each of their attached physical networks."
    ],
    "MOSFET": [
        "Metal Oxide Silicon Field Effect Transistor",
        "MOSFETs are field-effect transistors with an insulated gate. They are commonly used for amplifying or switching electronic signals due to their ability to change conductivity with the amount of applied voltage."
    ],
    "MPLS": [
        "Multi Protocol Label Switching",
        "MPLS is an IP packet routing technique that directs data from one node to the next based on labels instead of looking at complex routing tables of routers."
    ],
    "MRP": [
        "Multiple Registration Protocol",
        "MRP, which replaced GARP (Generic Attribute Registration Protocol), is a generic registration framework defined by the IEEE 802.1ak amendment to the IEEE 802.1Q standard. MRP allows bridges, switches or other similar devices to register and de-register attribute values, such as VLAN identifiers and multicast group membership across a large local area network."
    ],
    "MSB": [
        "Most Significant Bit",
        "MSB is the bit in a multi-bit binary number with the largest value and is located on the leftmost side. It is of great significance in binary arithmetic and can be either 1 or 0."
    ],
    "MSTP": [
        "Multiple Spanning Tree Protocol",
        "Multiple Spanning Tree Protocol (MSTP) is an algorithm that enables easy and full connectivity provided to any Virtual LAN (VLAN) across an Integrated Area Network."
    ],
    "NLP": [
        "Normal Link Pulse",
        "NLPs are the Link Integrity Test (LIT) pulses used in Ethernet networks for Auto-Negotiation,  which are sent between the 10Base-T stations and the 100Base-T stations so that they can determine whether the other station is operating at 10 Mbps or 100 Mbps. The NLPs consist of a single uni-polar positive-only pulse for the duration of 100 ns at an interval of 16 ms with a ±8 ms window. Its purpose is to establish a communication link between devices and allow them to negotiate their transmission speed and other parameters to ensure optimal network performance."
    ],
    "NRZ": [
        "Non-Return-to-Zero ",
        "A NRZ line code is a binary code used in telecommunications transmission. At the start of each bit time, the signal level goes high (positive voltage) if the data bit is 1, or low (negative voltage) if the data bit is 0."
    ],
    "NRZI": [
        "Non-Return-to-Zero-Inverted",
        "NRZI is a method of mapping binary signals to physical signals for transmission. The two-level NRZI signal distinguishes data bits by the presence or absence of a transition at a clock boundary."
    ],
    "OAM": [
        "Operations, Administration, and Maintenance",
        "OAM is a general term that provides network operators the ability to monitor the health of the network and quickly determine the location of failing links or fault conditions. Over the years, various OAM tools have been defined for various layers in the protocol stack."
    ],
    "OUI": [
        "Organizationally Unique Identifier",
        "An OUI is a 24-bit globally unique number used to identify the manufacturer or vendor of a network device. It is referenced by standards like Ethernet and Wi-Fi and is assigned by the IEEE. OUIs are used in MAC addresses to manage address allocation and identify the source of network traffic."
    ],
    "PCP": [
        "Priority Code Point",
        "PCP is used as a means for classifying and managing network traffic, and providing QoS (Quality of Service) in Layer 2 Ethernet networks. It uses the 3-bit PCP field in the VLAN header for the purpose of packet classification."
    ],
    "PCS": [
        "Physical Coding Sublayer",
        "PCS is a sublayer of the Ethernet PHY (Physical Layer) that provides an interface between the PMA (Physical Medium Attachment) sublayer and the MII (Media-Independent Interface). It is responsible for encoding and decoding data streams, and is used in Fast Ethernet, Gigabit Ethernet, and 10 Gigabit Ethernet standards."
    ],
    "PHY": [
        "Physical Layer Device",
        "A PHY is an electronic circuit that implements the physical layer functions of the OSI model. It is responsible for signal encoding and decoding, modulation, and physical connection management. PHYs are critical in establishing reliable communication between network devices and play a crucial role in the overall performance and stability of the network."
    ],
    "PLL": [
        "Phase-Locked Loop",
        "PLL is a feedback circuit used to synchronize the phase of a circuit board's clock signal with an external timing signal. It compares the phase of an external signal with the phase of the clock signal generated by a voltage-controlled oscillator (VCO). PLLs are widely used in electronics for generating, stabilizing, modulating, demodulating, filtering, or recovering signals from noisy communication channels, among other functions."
    ],
    "PMA": [
        "Physical Medium Attachment",
        "PMA is an analog front-end (AFE) for transceivers, responsible for transmitting and receiving high-speed serial data based on the transceiver channel configuration. It is a sublayer of the Ethernet PHY and is used in Ethernet networking technologies."
    ],
    "PMD": [
        "Physical Medium Dependent",
        "PMD is a sublayer within the OSI model's physical layer. It determines how bits are transmitted and received over the physical medium, including responsibilities such as bit timing, signal encoding, modulation, and handling the properties of the transmission medium. PMD plays a critical role in ensuring reliable communication and optimal network performance, facilitating the successful transmission of data across the network medium, including properties of cables, optical fibers, or wires used for transmission."
    ],
    "POR": [
        "Power-On Reset",
        "POR is a circuit that ensures a predictable, regulated voltage is provided to a microprocessor or microcontroller upon the initial application of power. This system ensures that the microprocessor or microcontroller starts in a consistent condition each time it is powered up."
    ],
    "PRBS": [
        "Pseudo-random Binary Sequence",
        "PRBS is a binary sequence generated by a deterministic algorithm that appears to be random. The value of a PRBS element is independent of the values of any of the other elements, similar to real random sequences. PRBS generators are commonly used in digital communication systems for synchronization, channel estimation, and testing."
    ],
    "PTP": [
        "Precision Time Protocol",
        "PTP defined in the IEEE1588-2008 standard, is a network-based time synchronization communication protocol that uses a master-slave hierarchy to synchronize clocks of different device types. PTP uses hardware time stamping to achieve submicrosecond synchronization, more accurate than NTP (Networked Time Protocol) which achieves millisecond accuracy. PTP also accounts for device latency while synchronizing time."
    ],
    "QFN": [
        "Quad Flat No-lead",
        "A QFN package is a very small square-shaped or rectangular surface-mount plastic package with no leads. QFN is a lead frame-based package which is also called CSP (Chip Scale Package) with the ability to view and contact leads after assembly."
    ],
    "QoS": [
        "Quality of Service",
        "The QoS networking technology is to control traffic and ensure the performance of critical applications with limited network capacity."
    ],
    "RAM": [
        "Random Access Memory",
        "RAM is a computer's short-term memory, where data that the processor is currently using is stored temporarily."
    ],
    "RMA": [
        "Reserved Multicast Address",
        "A multicast address is a specific type of IP address labeling a network location that is used to multicast data packets within a network."
    ],
    "RMS": [
        "Root Mean Square",
        "RMS is the square root of the mean square, which is the arithmetic mean of the squares of a group of values."
    ],
    "RSTP": [
        "Rapid Spanning Tree Protocol",
        "RSTP is the more improved and advanced version of STP (Spanning Tree Protocol) which is a layer 2 protocol that prevents bridge loops and broadcast storms in local networks with redundant connections. RSTP has faster convergence and it is also backward-compatible with STP."
    ],
    "SCL": [
        "Serial Clock",
        "SCL is the line that carries the clock signal."
    ],
    "SDA": [
        "Serial Data",
        "SDA is the line for the master and slave to send and receive data."
    ],
    "SFD": [
        "Start of Frame Delimiter",
        "The SFD is a special, typically fixed bit sequence (depending on the network protocol being used) that indicates the start of a frame or packet. The SFD is used to synchronize the receiver's internal clock with the sender's clock."
    ],
    "SMI": [
        "Serial Management Interface",
        "SMI is a Micrel proprietary interface that is used to read and write registers in the device. Usually, it uses MDC and MDIO to access the PHY's internal registers to read the state of the link (up/down), duplex mode, speed, and to restart auto-negotiation etc."
    ],
    "SNR": [
        "Signal-to-Noise Ratio",
        "SNR, also referred to as S/N ratio, compares the level of signal power to that of noise power. The noise is measured by the RMS (Root Mean Square) value of the fluctuations over time. SNR is commonly expressed in decibels (dB), with higher values generally indicating a better specification."
    ],
    "SOC": [
        "System on a Chip",
        "A system-on-chip is the integration of functions necessary to implement an electronic system onto a single substrate and contains at least one processor."
    ],
    "SP": [
        "Strict Priority",
        "SP imparts the highest service to high priority traffic. Egress traffic from the highest priority queue is transmitted first."
    ],
    "SPI": [
        "Serial Peripheral Interface",
        "SPI is a synchronous, full duplex main-subnode-based interface, one of the most widely used interfaces between microcontroller and peripheral ICs such as sensors, ADCs, DACs, shift registers, and others."
    ],
    "STP": [
        "Spanning Tree Protocol",
        "STP is a Layer 2 network protocol that builds a loop-free logical topology for Ethernet networks to prevent bridge loops and the resulting broadcast storms.",
        "Shielded Twisted Pair",
        "The STP cable is a pair of wires wound around each other and each pair is placed inside a protective foil wrap to protect it from crosstalk."
    ],
    "SVL": [
        "Shared VLAN Learning",
        "Two or more VLANs are grouped to share common source address information. This setting would be useful for configuration of more complex \"asymmetrical cross-vlan\" traffic patterns, without forcing the switch to flood the unicast traffic in each direction."
    ],
    "TAI": [
        "International Atomic Time, or Temps Atomique International",
        "TAI is the time standard used by PTP, which at the time of writing is 37 seconds ahead of UTC (Universal Coordinated Time). TAI is always ahead of GPS (Global Positioning System) by 19 seconds."
    ],
    "TC": [
        "Traffic Class",
        "A traffic class is a systemwide collection of buffers, queues, and bandwidth that you can allocate to provide a defined level of service to packets in the traffic class."
    ],
    "TCAM": [
        "Ternary Content Addressable Memory",
        "TCAM is a type of content-addressable memory (CAM) that allows a third state of \"don't care\" or \"X\" in one or more of the bits of stored data, adding flexibility to the search."
    ],
    "TCP": [
        "Transmission Control Protocol",
        "TCP is a widely-used networking protocol that ensures reliable and error-checked delivery of data. It is commonly used in web browsing (HTTP), email transmission (SMTP), and file transfers (FTP).\nUnlike UDP (User Datagram Protocol) which prioritizes speed and low latency, TCP is connection-oriented and prioritizes reliability."
    ],
    "TD": [
        "Tail Drop",
        "Tail-drop is a feature that makes it easy to send files between your personal devices on a Tailscale network. Like all traffic sent over Tailscale, Taildrop transfers files over encrypted peer-to-peer connections, using the fastest available path."
    ],
    "TDD": [
        "Test Driven Development",
        "Test Driven Development is the process in which test cases are written before the code that validates those cases. It depends on repetition of a very short development cycle."
    ],
    "TDO": [
        "Test Data Output",
        "Test data is data which has been specifically identified for use in tests."
    ],
    "TDR": [
        "Time Domain Reflectometry",
        "TDR is a cable testing technique to locate low resistive cable faults, cable interruptions, and joints along the cable. A time domain reflectometer sends a low voltage pulse onto a cable and measures the time it takes for the reflection (if any impedance change) to return from a short or break in the cable. This signal delay helps us determine the type of impedance change or failure that could be present in the cable. Time domain reflectometers are available for testing both copper cabling and fiber-optic cabling."
    ],
    "TLS": [
        "Transport Layer Security",
        "TLS is a cryptographic protocol used to secure communications over a network, by encrypting data into non-human-readable formats, verifying the identities of communicating parties, and ensuring the integrity of transmitted data."
    ],
    "TOS": [
        "Type of Service",
        "The TOS field is the second byte of the IPv4 header, an 8-bit length binary number field."
    ],
    "TPID": [
        "Tag Protocol Identifier",
        "TPID is a 16-bit field set to a value of 0x8100 in order to identify the frame as an IEEE 802.1Q-tagged frame."
    ],
    "TTL": [
        "Time-to-Live",
        "TTL or hop limit is a mechanism which limits the lifespan or lifetime of data in a computer or network. TTL may be implemented as a counter or timestamp attached to or embedded in the data."
    ],
    "UART": [
        "Universal Asynchronous Receiver/Transmitter",
        "The UART is one of the most used device-to-device communication protocols."
    ],
    "UDP": [
        "User Datagram Protocol",
        "UDP is another one of the major protocols that make up the internet protocol suite. UDP is less reliable than TCP but is much simpler."
    ],
    "UTP": [
        "Unshielded Twisted Pair",
        "The UTP is a common type of copper cabling used for telecommunications and computer networking. It consists of pairs of twisted wires that are not shielded by any outer layer, unlike shielded twisted pair (STP) cabling. UTP cables are classified into different categories (CAT) based on their performance specifications, with each category supporting different bandwidths and applications."
    ],
    "VC": [
        "Virtual Channel",
        "A virtual channel consists of a client-side virtual driver that communicates with a server-side application."
    ],
    "VID": [
        "VLAN ID",
        "A 12-bit identifier of VLAN (Virtual Local Area Network), which identifies the VLAN to which each frame belongs to."
    ],
    "VLAN": [
        "Virtual Local Area Network",
        "VLAN creates multiple smaller broadcast domains over a single Ethernet network. They are used to logically group together devices and improve network efficiency and security. VLAN has a 12-bit identifier called \"VID\" (VLAN ID), which identifies the VLAN to which each frame belongs to. This ensures that the data packets in a single VLAN reach only the devices in that virtual LAN."
    ],
    "VPG": [
        "Video Pattern Generator",
        "VPG is the video test equipment which emulates desired test patterns to test functionality and evaluate performance various video processing systems."
    ],
    "WDT": [
        "Watchdog Timer",
        "A WDT is a timer that monitors microcontroller (MCU) programs to see if they are out of control or have stopped operating. It acts as a \"watchdog\" watching over MCU operation. If the operation of the code in the device is affected by an external source that causes the software to deviate from its expected path, the WDT may be able to reset the device automatically depending how the reset is used in the design."
    ],
    "WOL": [
        "Wake-on-LAN",
        "WOL is a computer networking standard that allows a computer to be turned on or awakened from sleep mode within LAN (Local Area Network) by a network message. This feature is commonly used to remotely wake up a computer for maintenance or software updates without physically accessing the device."
    ],
    "WUR": [
        "Wake-up Request",
        "A WUR is a command used by a node to request that another node or gateway be awakened on the network. The WUR command can be sent by the PHY layer of a node or switch and is typically transmitted over an active link."
    ],
    "WUP": [
        "Wake-up Pulse",
        "The WUP is similar to WUR but is used to awaken nodes or gateways on inactive links. Unlike WUR, which is transmitted over an active link, WUP is transmitted over an inactive link."
    ]
}